Documents/ЗаявкаНаЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>ЗаявкаНаЗвонок</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqData</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqContact</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПолученияЗаявокНаCallBack</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаявкиCallBack</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявкиНаЗвонок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВызова</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВызовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыРаспределенияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоступленияЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаявковПоВремениПоступления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыРаботыЗавок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокДозвониться</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриоритетыЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТестоваяЗаявка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqStatus</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>reqID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UCID</Name>
					<Comment>Обратный звонок</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Запрос</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Взаимодействие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркетинговоеМероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПопытокСегодня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаспределенияЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПланированияВстречи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланироваиняВстреч</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеДополнительнойГруппировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоляДополнительныхГруппировокЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеCQ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияCQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КлиентыCQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>КлиентыCQ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыПолученияЗаявокНаCallBack</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_referrer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_referrer_domain</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_utm_campaign</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UTM_Campaign</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_utm_source</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UTM_Source</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_utm_medium</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UTM_Medium</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_utm_content</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UTM_Content</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Initial_utm_term</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.UTM_Term</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Country</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Region</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>City</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email_unsubscribed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Popup</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>User_id</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИзмененияЗаявокНаЗвонок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ИзмененияЗаявокНаЗвонок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтароеЗначениеРесурс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределениеИзмененияЗаявкиНаЗвонок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НовоеЗначениеРесурс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределениеИзмененияЗаявкиНаЗвонок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаЗвонок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИзменения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИзмененияЗаявокНаЗвонок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтароеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределениеИзмененияЗаявкиНаЗвонок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НовоеЗначение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОпределениеИзмененияЗаявкиНаЗвонок</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявкаНаЗвонок/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ВзаимодействияПереопределяемый.ПриЗаполненииНаборовЗначенийДоступа(ЭтотОбъект, Таблица);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

Процедура УстановитьПометкуУдаленияУВложенийЗаявкиНаЗвонок(ЗаявкаНаЗвонок, ПометкаУдаления) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ИмяОбъектаМетаданных = "ЗаявкаНаЗвонокПрисоединенныеФайлы";

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Файлы.Ссылка КАК Ссылка,
	|	Файлы.Редактирует КАК Редактирует	
	|ИЗ
	|	Справочник." + ИмяОбъектаМетаданных + " КАК Файлы
	|ГДЕ
	|	Файлы.ПометкаУдаления <> &ПометкаУдаления
	|	И Файлы.ВладелецФайла = &ВладелецФайла
	|");
	Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПометкаУдаления И ЗначениеЗаполнено(Выборка.Редактирует) Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '""%1"" не может быть удален,
				|т.к. содержит присоединенный файл ""%2"",
				|занятый для редактирования.'"),
				Строка(Ссылка),
				Строка(Выборка.Ссылка));
		КонецЕсли;		
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Попытка
			Объект.Заблокировать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось заблокировать объект " + Объект + "! " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		Объект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	УправлениеЗаявкамиНаЗвонок.УстановитьПолеДополнительнойГруппировки(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Ссылка) И НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ДополнительныеСвойства.Вставить("ВидыИзменения", ПолучитьВидИзмененияДокумента(РежимЗаписи));
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда	
		ДополнительныеСвойства.Вставить("ТекущийСтатус", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус"));	
	КонецЕсли;	

	УстановитьПометкуУдаленияУВложенийЗаявкиНаЗвонок(Ссылка, ПометкаУдаления);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	//Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//<841632>, Басаргин (27.07.2018) {
	Если ЗначениеЗаполнено(reqID)
		И ТипВызова = Перечисления.ТипыВызовов.ЗаявкаОтCQ
		И ЗначениеЗаполнено(Контакт) Тогда
		НаборЗаписей = РегистрыСведений.КлиентыCQ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.User_id.Установить(reqID);
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() Тогда
			Запись = НаборЗаписей[0];
			Если НЕ Запись.Клиент = Контакт Тогда
				Запись.Клиент = Контакт;
				НаборЗаписей.Записать();	
			КонецЕсли;
		КонецЕсли;					
	КонецЕсли;
	//<841632> }
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыСведений.ИзмененияЗаявокНаЗвонок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ЗаявкаНаЗвонок.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	ТаблицаНабор = НаборЗаписей.Выгрузить();
	
	Если ДополнительныеСвойства.Свойство("ВидыИзменения") И НЕ ДополнительныеСвойства.ВидыИзменения = Неопределено И ДополнительныеСвойства.ВидыИзменения.Количество() Тогда		
		ДобавитьИзмененияДокумента(ТаблицаНабор, Ссылка, ТекущаяДата(), ДополнительныеСвойства.ВидыИзменения);
		Если ТаблицаНабор.Количество() Тогда
			НаборЗаписей.Загрузить(ТаблицаНабор);
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Взаимодействие) Тогда
		Возврат;
	КонецЕсли;
	
	ВзаимодействиеОбъект = Взаимодействие.ПолучитьОбъект();
	Если ВзаимодействиеОбъект = Неопределено Тогда														
		Возврат;	
	КонецЕсли;
	
	ТекущийСтатус = Неопределено;
	Если ДополнительныеСвойства.Свойство("ТекущийСтатус") И НЕ ДополнительныеСвойства.ТекущийСтатус = Неопределено Тогда
		ТекущийСтатус = ДополнительныеСвойства.ТекущийСтатус;
	КонецЕсли;	
	
	АктуальныйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Статус");
	
	Изменение_ОбработаноВРаботе = (ТекущийСтатус = Перечисления.СтатусЗаявкиCallBack.Обработано ИЛИ ТекущийСтатус = Перечисления.СтатусЗаявкиCallBack.Отменено) И АктуальныйСтатус = Перечисления.СтатусЗаявкиCallBack.БылиПопыткиДозвониться;
	Изменение_Обработано = АктуальныйСтатус = Перечисления.СтатусЗаявкиCallBack.Обработано;
	
	МассивИзмененийВзаимодействия = Новый Массив;
	
	Если ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.Встреча") Тогда		
		Если Изменение_ОбработаноВРаботе Тогда			
			СтатусВзаимоедйствия = РегистрыСведений.Взаимодействия.ПолучитьТекущийСтатусВзаимодействия(Взаимодействие);			
			Если СтатусВзаимоедйствия = Перечисления.СтатусыВзаимодействий.Запланировано Тогда
 				//?
			ИначеЕсли СтатусВзаимоедйствия = Перечисления.СтатусыВзаимодействий.Завершено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно перевести в статус ""В работе"" по встрече " + Взаимодействие, ЭтотОбъект, "Статус",  , Отказ);
				Возврат;
			ИначеЕсли СтатусВзаимоедйствия = Перечисления.СтатусыВзаимодействий.Отменено Тогда
				РегистрыСведений.Взаимодействия.УстановитьСтатусВзаимодействияСФиксациейИзменений(Взаимодействие, Перечисления.СтатусыВзаимодействий.Запланировано, МассивИзмененийВзаимодействия);
			КонецЕсли;
		КонецЕсли;				
		Если Изменение_Обработано Тогда
			ДополнительныеСвойства.Вставить("ВстречаДляОткрытия", Взаимодействие);
		КонецЕсли;			
	ИначеЕсли ТипЗнч(Взаимодействие) = Тип("ДокументСсылка.ТелефонныйЗвонок") Тогда			
		Если Изменение_ОбработаноВРаботе Тогда			
			РегистрыСведений.Взаимодействия.УстановитьСтатусВзаимодействияСФиксациейИзменений(Взаимодействие, Перечисления.СтатусыВзаимодействий.Запланировано, МассивИзмененийВзаимодействия, 
				РегистрыСведений.Взаимодействия.ПолучитьОтветственногоИзИзмененияВзаимодействий(Взаимодействие));			
		КонецЕсли;		
		Если Изменение_Обработано Тогда			
			//<>, Басаргин (29.05.2018) {
			//РегистрыСведений.Взаимодействия.УстановитьСтатусВзаимодействияСФиксациейИзменений(Взаимодействие, Перечисления.СтатусыВзаимодействий.Завершено, МассивИзмененийВзаимодействия, Пользователи.ТекущийПользователь());
			СтруктураРеквизитов = Взаимодействия.СтруктураРеквизитовВзаимодействия(Взаимодействие);
			АктуальныйСтатус = РегистрыСведений.Взаимодействия.ПолучитьТекущийСтатусВзаимодействия(Взаимодействие, СтруктураРеквизитов);
			Если АктуальныйСтатус = Перечисления.СтатусыВзаимодействий.Запланировано Тогда
				РегистрыСведений.Взаимодействия.УстановитьСтатусВзаимодействияСФиксациейИзменений(Взаимодействие, Перечисления.СтатусыВзаимодействий.Завершено, МассивИзмененийВзаимодействия, Пользователи.ТекущийПользователь());		
			КонецЕсли;
			//<> }						
		КонецЕсли;
	КонецЕсли;	
	
	Если МассивИзмененийВзаимодействия.Количество() Тогда
		РегистрыСведений.Взаимодействия.ЗафиксироватьИзмененияВзаимодействия(МассивИзмененийВзаимодействия);
	КонецЕсли;		
	
	ДополнительныеСвойства.Вставить("ЗаявкиПоТекущемуНомеру", УправлениеЗаявкамиНаЗвонок.ПолучитьЗаявкиНаЗвонокПоНомеру(Ссылка, reqContact));
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если Не Отказ Тогда
		НаборЗаписей = РегистрыСведений.ИзмененияЗаявокНаЗвонок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаНаЗвонок.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;		
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьВидИзмененияДокумента(РежимЗаписи = Неопределено)
	
	ВидыИзменения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаявкаНаЗвонок.Статус КАК Статус,
	|	ЗаявкаНаЗвонок.ЭтапРаботы КАК ЭтапРаботы,
	|	ЗаявкаНаЗвонок.Ответственный КАК Ответственный,
	|	ЗаявкаНаЗвонок.Контакт КАК Контакт,
	|	ЗаявкаНаЗвонок.ПлановоеВремя КАК ПлановоеВремя,
	|	ЗаявкаНаЗвонок.Приоритет КАК Приоритет,
	|	ЗаявкаНаЗвонок.ЭтоТестоваяЗаявка КАК ЭтоТестоваяЗаявка,
	|	ЗаявкаНаЗвонок.ТипРаспределения КАК ТипРаспределения,
	|	ЗаявкаНаЗвонок.СтатусПланированияВстречи КАК СтатусПланированияВстречи
	|ИЗ
	|	Документ.ЗаявкаНаЗвонок КАК ЗаявкаНаЗвонок
	|ГДЕ
	|	НЕ ЗаявкаНаЗвонок.ПометкаУдаления
	|	И ЗаявкаНаЗвонок.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если НЕ ВыборкаДетальныеЗаписи.Статус = Статус Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.Статус;
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.Статус, Статус));
			КонецЕсли;			
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.ЭтапРаботы = ЭтапРаботы Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.ЭтапРаботы;
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.ЭтапРаботы, ЭтапРаботы));
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.Ответственный = Ответственный Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.Ответственный;
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.Ответственный, Ответственный));
			КонецЕсли;
		КонецЕсли;
		//Если НЕ ВыборкаДетальныеЗаписи.Контакт = Контакт Тогда
		//	ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.Контакт;
		//	Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
		//		ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.Контакт, Контакт));
		//	КонецЕсли;
		//КонецЕсли;
		//Если НЕ ВыборкаДетальныеЗаписи.ПлановоеВремя = ПлановоеВремя Тогда
		//	ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.ПлановоеВремя;	
		//	Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
		//		ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.ПлановоеВремя, ПлановоеВремя));
		//	КонецЕсли;
		//КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.Приоритет = Приоритет Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.Приоритет;
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.Приоритет, Приоритет));
			КонецЕсли;
		КонецЕсли;
		//Если НЕ ВыборкаДетальныеЗаписи.ЭтоТестоваяЗаявка = ЭтоТестоваяЗаявка Тогда
		//	ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.ЭтоТестоваяЗаявка;			
		//	Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
		//		ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.ЭтоТестоваяЗаявка, ЭтоТестоваяЗаявка));
		//	КонецЕсли;
		//КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.ТипРаспределения = ТипРаспределения Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.ТипРаспределения;			
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.ТипРаспределения, ТипРаспределения));
			КонецЕсли;
		КонецЕсли;
		Если НЕ ВыборкаДетальныеЗаписи.СтатусПланированияВстречи = СтатусПланированияВстречи Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.СтатусПланированияВстречи;			
			Если ВидыИзменения.Найти(ВидИзменения) = Неопределено Тогда
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, ВыборкаДетальныеЗаписи.СтатусПланированияВстречи, СтатусПланированияВстречи));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ВидыИзменения.Количество() И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		НаборЗаписей = РегистрыСведений.ИзмененияЗаявокНаЗвонок.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЗаявкаНаЗвонок.Установить(Ссылка);
		НаборЗаписей.Прочитать();
		Если НЕ НаборЗаписей.Количество() Тогда
			ВидИзменения = Перечисления.ВидыИзмененияЗаявокНаЗвонок.Новая;
			Если НайтиПоВидуИзменения(ВидыИзменения, ВидИзменения) = Неопределено Тогда                                                                                                                                     
				ВидыИзменения.Добавить(Новый Структура("ВидИзменения, СтароеЗначение, НовоеЗначение", ВидИзменения, Документы.ЗаявкаНаЗвонок.ПустаяСсылка(), Ссылка));
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ВидыИзменения;
	
КонецФункции

Процедура ДобавитьИзмененияДокумента(Набор, Регистратор, ДатаИзменения, ВидыИзменения)
	
	Для каждого Элемент Из ВидыИзменения Цикл
		НоваяЗапись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Элемент);
		НоваяЗапись.ДатаИзменения = ДатаИзменения;
		НоваяЗапись.ЗаявкаНаЗвонок = Регистратор;
		НоваяЗапись.АвторИзменения = Пользователи.АвторизованныйПользователь();
		Если НЕ ЗначениеЗаполнено(НоваяЗапись.АвторИзменения) Тогда
			НоваяЗапись.АвторИзменения = Справочники.Пользователи.Робот;
		КонецЕсли;
	КонецЦикла;		
			
КонецПроцедуры

Функция НайтиПоВидуИзменения(ВидыИзменения, ВидИзменения)
	
	Для каждого Элемент Из ВидыИзменения Цикл
		Если Элемент.ВидИзменения = ВидИзменения Тогда
			Возврат ВидИзменения;	
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

#КонецОбласти
